In [1]:
import pandas as pd
addresses = {"address": ["4860 Sunset Boulevard, San Francisco, 94105", "3055 Paradise Lane, Salt Lake City, 84103", "682 Main Street, Detroit, 48204", "9001 Cascade Road, Kansas City, 64102", "5853 Leon Street, Tampa, 33605"]}
cities = {"city": ["Salt Lake City", "Kansas City", "Detroit", "Tampa", "San Francisco"], "state": ["Utah", "Missouri", "Michigan", "Florida", "California"]}
df_addresses = pd.DataFrame(addresses)
df_cities = pd.DataFrame(cities)

In [2]:
df_addresses

                                       address
0  4860 Sunset Boulevard, San Francisco, 94105
1    3055 Paradise Lane, Salt Lake City, 84103
2              682 Main Street, Detroit, 48204
3        9001 Cascade Road, Kansas City, 64102
4               5853 Leon Street, Tampa, 33605

In [3]:
df_cities

             city       state
0  Salt Lake City        Utah
1     Kansas City    Missouri
2         Detroit    Michigan
3           Tampa     Florida
4   San Francisco  California

In [11]:
df_addresses["Street"]=[x.split(",")[0] for x in df_addresses["address"]] 
df_addresses["City"]=[x.split(",")[1] for x in df_addresses["address"]] 
df_addresses["Zip"]=[x.split(",")[2] for x in df_addresses["address"]]

In [12]:
df_addresses

,address,Street,City,Zip
0,"4860 Sunset Boulevard, San Francisco, 94105",4860 Sunset Boulevard,San Francisco,94105
1,"3055 Paradise Lane, Salt Lake City, 84103",3055 Paradise Lane,Salt Lake City,84103
2,"682 Main Street, Detroit, 48204",682 Main Street,Detroit,48204
3,"9001 Cascade Road, Kansas City, 64102",9001 Cascade Road,Kansas City,64102
4,"5853 Leon Street, Tampa, 33605",5853 Leon Street,Tampa,33605

In [13]:
df_addresses=df_addresses.drop("address",axis=1)

In [14]:
df_addresses

                  Street             City     Zip
0  4860 Sunset Boulevard    San Francisco   94105
1     3055 Paradise Lane   Salt Lake City   84103
2        682 Main Street          Detroit   48204
3      9001 Cascade Road      Kansas City   64102
4       5853 Leon Street            Tampa   33605

In [15]:
df_addresses["State"]=[df_cities[df_cities["city"]==x.strip()]["state"] for x in df_addresses["City"]]

In [16]:
df_addresses

,Street,City,Zip,State
0,4860 Sunset Boulevard,San Francisco,94105,"4 California Name: state, dtype: object"
1,3055 Paradise Lane,Salt Lake City,84103,"0 Utah Name: state, dtype: object"
2,682 Main Street,Detroit,48204,"2 Michigan Name: state, dtype: object"
3,9001 Cascade Road,Kansas City,64102,"1 Missouri Name: state, dtype: object"
4,5853 Leon Street,Tampa,33605,"3 Florida Name: state, dtype: object"

In [18]:
df_addresses["State"]

0    4    California
Name: state, dtype: object
1          0    Utah
Name: state, dtype: object
2      2    Michigan
Name: state, dtype: object
3      1    Missouri
Name: state, dtype: object
4       3    Florida
Name: state, dtype: object
Name: State, dtype: object

In [21]:
[x for x in df_addresses["City"]]

[' San Francisco', ' Salt Lake City', ' Detroit', ' Kansas City', ' Tampa']

In [22]:
df_cities["city"]

0    Salt Lake City
1       Kansas City
2           Detroit
3             Tampa
4     San Francisco
Name: city, dtype: object